Ran Plan for 2 projects:

1. project: `app-rapadura-dev` dir: `infrastructure/app-rapadura` workspace: `dev`
1. project: `s3-dev` dir: `infrastructure/s3` workspace: `dev`

### 1. project: `app-rapadura-dev` dir: `infrastructure/app-rapadura` workspace: `dev`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.web["instance_1"] will be created
+ resource "aws_instance" "web" {
      + ami                                  = "ami-0070c5311b7677678"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "access.dev"
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-03adca08d0aa69d1e"
      + tags                                 = {
          + "CreationOrigin" = "terraform"
          + "Env"            = "dev"
          + "SubSystem"      = "Metal.corp"
          + "System"         = "Instancia-ec2"
          + "Team"           = "DevOps-CE"
        }
      + tags_all                             = {
          + "CreationOrigin" = "terraform"
          + "Env"            = "dev"
          + "SubSystem"      = "Metal.corp"
          + "System"         = "Instancia-ec2"
          + "Team"           = "DevOps-CE"
        }
      + tenancy                              = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p app-rapadura-dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://5b7b-2804-1eb0-a0-13cd-4ef6-3f65-d888-a72b.sa.ngrok.io/lock?id=EzzioMoreira%252Fterraform-atlantis%252Finfrastructure%252Fapp-rapadura%252Fdev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p app-rapadura-dev`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `s3-dev` dir: `infrastructure/s3` workspace: `dev`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.this["bucket1"] will be created
+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "metal-corp-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CreationOrigin" = "terraform"
          + "Env"            = "dev"
          + "SubSystem"      = "Metal.corp"
          + "System"         = "S3"
          + "Team"           = "DevOps-CE"
        }
      + tags_all                    = {
          + "CreationOrigin" = "terraform"
          + "Env"            = "dev"
          + "SubSystem"      = "Metal.corp"
          + "System"         = "S3"
          + "Team"           = "DevOps-CE"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # aws_s3_bucket_public_access_block.this["bucket1"] will be created
+ resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p s3-dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://5b7b-2804-1eb0-a0-13cd-4ef6-3f65-d888-a72b.sa.ngrok.io/lock?id=EzzioMoreira%252Fterraform-atlantis%252Finfrastructure%252Fs3%252Fdev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p s3-dev`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
